#!/usr/bin/env python
# coding: utf-8

#Κύριο πρόγραμμα
import classes as cl


def guidelines():
    """Τεκμηρίωση:
    1. Στον κώδικα υπάρχουν οι εξής κλάσεις:
          α) SakClass : αντιπροσωπεύει το σακουλάκι με τα γράμματα του Scrabble
          β) Player : αφορά τον παίκτη που παίζει το παιχνίδι
          γ) Human : είναι ένα είδος παίκτη, που αντιπροσωπεύει τον χρήστη. Η συγκεκριμένη κλάση κληρονομεί από την
             κλάση Player
          δ) Computer : είναι ένα άλλο είδος παίκτη, που αφορά τον υπολογιστή. Η κλάση Computer είναι επίσης παράγωγη
             της Player
    2. Κληρονομικότητα: Όπως προαναφέρθηκε, οι κλάσεις Human και Computer είναι παράγωγες της βασικής κλάσης Player. Οι
       ιδιότητες name, score και letters της Player base class, κληρονομούνται στις derived Human και Player
    3. Στην κλάση Player, που είναι και η μόνη βασική κλάση του παιχνιδιού, υπάρχουν οι εξής απλές μέθοδοι που
       κληρονομούνται:
          a)__init__ : ο κλασικός constructor σε αντικειμενοστραφείς εφαρμογές
          β)show_letters: Εμφανίζονται στην οθόνη τα letters της κλάσης Player(τα γράμματα που διαθέτει ο παίκτης)
          γ)increase_score: Αυξάνει το score του Player κατά ένα θετικό ακέραιο αριθμό
       Οι κλάσεις Human και Computer επεκτείνουν τις προαναφερθείσες μεθόδους ως εξής:
          α) Καλείται ο κατασκευαστής της βασικής κλάσης player και έπειτα προστίθεται η νέα ιδιότητα value_of_letters,
           που είναι η αξία των γραμμάτων που έχουν δοθεί στον χρήστη ή τον υπολογιστή και αρχικοποιείται ως κενή λίστα.
          β) Τα γράμματα εμφανίζονται μαζί με την αξία τους
          γ) Καλείται η increase_score της base class και εμφανίζεται και ενημερωτικό μήνυμα στον χρήστη
    4. Στην base class Player υπάρχουν οι εξής decorator μέθοδοι:
          α) score_decorator
          β) final_score_decorator
       Στις παράγωγες κλάσεις Human και Player οι μέθοδοι είναι είσοδοι στις decorator της Player είναι οι εξής:
          α) show_score
          β) show_final_score
       Και στις δύο περιπτώσεις, οι decorators προσθέτουν επιπλέον μηνύματα προς τον χρήστη, αυξάνοντας με αυτόν τον
       τρόπο τη λειτουργικότητα των μεθόδων στις derived classes.
       Στην κλάση Game υπάρχουν οι κάτωθι decorators/static methods:
          a) print_menu (static): εκτυπώνει όταν είναι απαραίτητο τις default επιλογές του Menu του παιχνιδιού
    5. Η δομή που χρησιμοποιήθηκε για την οργάνωση των αποδεκτών λέξεων είναι η dictionary. Η δομή του λεξικού είναι μη
       δεικτοδοτημένη δομή. Χρησιμοποιείται μια hash function για να αντιστοιχίσει keys και values στο λεξικό. Έτσι, η
       αναζήτηση των λέξεων είναι αρκετά γρήγορη. Η μέση χρονική απόδοση είναι O(1). Ως keys του λεξικού αξιοποιούνται
       οι ίδιες οι λέξεις, ενώ ως κλειδιά η αξία τους(το άθροισμα των αξιών των γραμμάτων τους). Αντίθετα, αν
       χρησιμοποιούνταν μια δεικτοδοτημένη δομή, όπως μια λίστα, η αναζήτηση θα ήταν χρονοβόρα και η απόδοση μειωμένη. Η
       πολυπλοκότητα χρονικά θα ήταν O(n). Επειδή στο πρόγραμμα χρησιμοποιείται πολλές φορές το λεξικό και αναζητούνται
       λέξεις, η αναζήτηση πρέπει να γίνεται γρήγορα.
    6. Ο υπολογιστής παίζει με βάση τον αλγόριθμο Min-Max-Smart σύμφωνα με τον οποίο:
          α) Αν το mode του παιχνιδιού είναι Min, τότε ο υπολογιστής παίζει την πρώτη αποδεκτή λέξη που θα βρει(με τα
             λιγότερα γράμματα που είναι εφικτό)
          β) Αν ο τρόπος(mode) του παιχνιδιού είναι Max, ο υπολογιστής παίζει την πρώτη αποδεκτή λέξει που θα βρει με τα
             περισσότερα γράμματα που είναι εφικτό να χρησιμοποιήσει
          γ) Αν ο τρόπος του παιχνιδιού είναι ο Smart, τότε επιλέγεται από τον υπολογιστή η λέξη που αποφέρει τη
             μεγαλύτερη βαθμολογία από τις λέξεις που θα μπορούσαν να επιλεχθούν.
       Ο χρήστης επιλέγει τον τρόπο που θέλει να παίξει ο υπολογιστής, αν πατήσει τον αριθμό 2 στο Menu που εμφανίζεται
       στην αρχή του παιχνιδιού, που αντιστοιχεί στις ρυθμίσεις. Αν, όμως, δεν κάνει κάποια ρύθμιση, ο default
       αλγόριθμος για τον υπολογιστή είναι ο Smart. Το Menu εμφανίζεται μόνο στην αρχή του παιχνιδιού, άρα ο τρόπος που
       παίζει ο υπολογιστής δεν μπορεί να αλλάξει κατά τη διάρκεια της παρτίδας.
    7. Κάποια σημαντικά στοιχεία για την υλοποίηση παρατίθενται κάτω:
       α) Το Menu καλείται και επανεμφανίζεται(ανάλογα με τις επιλογές του χρήστη) στην αρχή. Μόλις πατηθεί στο αρχικό
          Menu ο αριθμός 3, ξεκινάει η παρτίδα. Μόλις, όμως, η παρτίδα λάβει τέλος, το πρόγραμμα τερματίζει επιτυχώς.
          Για να ξανατρέξει το Menu και το παιχνίδι, πρέπει να εκτελεστεί ξανά το πρόγραμμα. Αυτή η ιδέα θα μπορούσε να
          επεκταθεί σε μια παραλλαγή του κώδικα, όπου μετά τη λήξη της παρτίδας το αρχικό Menu επανεμφανίζεται με τις
          ίδιες επιλογές και μπορούν να παιχθούν και άλλες παρτίδες, μέχρις ότου ο χρήστης πατήσει το 'q'.
       β) Στο αρχείο με τα στατιστικά, αποθηκεύονται οι κινήσεις κάθε παιχνιδιού(μετρώντας και τις κινήσεις όπου
          οι παίκτες πήγαν πάσο) και το Σκορ του χρήστη, όπως και του υπολογιστή. Το προαναφερθέν αρχείο περιλαμβάνει
          ήδη στατιστικά από παρτίδες που παίχτηκαν και δεν είναι εξ' αρχής κενό.
       γ) Όταν ο χρήστης χρησιμοποιήσει σωστά τα γράμματα που του δόθηκαν εμφανίζεται μήνυμα ότι πρέπει να ελεγχθεί και
          το λεξικό, ώστε να διαπιστωθεί εάν η λέξη είναι αποδεκτή. Εάν δεν είναι, του ζητείται να παίξει μια άλλη λέξη.
          Με αυτόν τον τρόπο ο χρήστης γνωρίζει τι λάθος έκανε στην εισαγωγή λέξης (έαν έβαλε λάθος γράμματα ή εάν η
          λέξη δεν υφίσταται στο λεξικό).
       δ) Εάν ο χρήστης εισαγάγει την κενή λέξη, δηλαδή πατήσει Enter, δίχως να έχει βάλει κάποια λέξη, εμφανίζεται
          σχετικό μήνυμα και το πρόγραμμα αναμένει να πατηθεί 'p','q' ή κάποια λέξη.
       ε) Το input του χρήστη θεωρείται αποδεκτό έαν είναι με κεφαλαία ελληνικά γράμματα, όταν πρόκειται για την εισαγωγή
          λέξης και εάν είναι με πεζό αγγλικό χαρακτήρα, εάν πρόκειται για 'p' ή 'q'.
       ζ) Εάν ο παίκτης πάει πάσο και δεν υπάρχουν γράμματα για να αντικαταστήσει τα δικά του, τότε το παιχνίδι λαμβάνει
          τέλος και πρέπει να εισαχθεί ο χαρακτήρας 'q' για να τερματίσει το πρόγραμμα.



        """
    pass
    

#Ξεκινάει το παιχνίδι
new_game = cl.Game()

